IDEA Open Model
TendonDuct Class
Compatible with IDEA StatiCa 20.1
 Tendon duct
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.TendonDuct
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class TendonDuct : OpenObject
Public Class TendonDuct
	Inherits OpenObject
The TendonDuct type exposes the following members.
Constructors
Name | Description
TendonDuct
Initializes a new instance of the TendonDuct class
Top
Properties
Name | Description
Diameter
 Diameter
Id
 Tendon duct Id
IsDebondingTube
 rue for debonding tubes, false for tendon ducts
MaterialDuct
 Tendon duct material
Point
 Position of duct
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace